ci-failure-patterns updated
Signed-off-by: sunshuang1866 <sunshuang1866@outlook.com>
